# ORACLE

In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [7]:
engine = create_engine ('oracle+cx_oracle://HKCJ:HKCJ@10.184.9.185:1521/xe')

In [25]:
selloutData = pd.read_sql_query('SELECT * FROM CJ_CHANNEL_SEASONALITY', engine)

selloutData.head(10)
# selloutData.dtypes

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0
5      A60  PRODUCT57   201402     14.0
6      A60  PRODUCT12   201402   1186.0
7      A60   PRODUCT1   201402      7.0
8      A60  PRODUCT33   201402    101.0
9      A60  PRODUCT62   201402    336.0

# POSTGRES

In [26]:
# DB:PW, pip install psycopg2
engine_gres = create_engine('postgresql://postgres:admin@10.184.9.185:5432/postgres')

In [27]:
selloutData.columns = selloutData.columns.astype(str).str.lower()
selloutData.head()

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

In [21]:
# selloutData.to_sql("sellout_result", engine_gres, if_exists="replace")

In [36]:
selloutData.dtypes

regionid     object
product      object
yearweek     object
qty         float64
dtype: object

In [37]:
from sqlalchemy import types

# 데이터 저장
resultname='sellout_result2'

to_varchar = {c:types.VARCHAR(selloutData[c].str.len().max()) \
        for c in selloutData.columns[selloutData.dtypes == 'object'].tolist()}

selloutData.to_sql(resultname, engine_gres, if_exists='replace', index=False,
                   dtype=to_varchar)

In [35]:
# DB 테이블을 읽어 Data Frame 변수에 저장하기
selloutData = pd.read_sql_query('SELECT * FROM sellout_result', engine_gres) 
selloutData.head(10)

  regionid    product yearweek      qty
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0
5      A60  PRODUCT57   201402     14.0
6      A60  PRODUCT12   201402   1186.0
7      A60   PRODUCT1   201402      7.0
8      A60  PRODUCT33   201402    101.0
9      A60  PRODUCT62   201402    336.0